{
    "id": "andvc_1746635645",
    "created_at": "2025-05-08T00:34:05",
    "name": "Andvc",
    "era": {
        "id": "grand_empire_era",
        "name": "万象帝国",
        "era_number": 5,
        "history": "万象帝国，作为第5纪元的辉煌代表，其起源可追溯至意识瘟疫后的废墟之中。人类，凭借其惊人的适应力和领导才能，率先从阴影中站起，与精灵、矮人及灵族结成了前所未有的多族联盟。这一联盟的成立，标志着万象帝国的诞生，一个致力于魔法与科技平衡发展的新时代由此开启。在早期发展阶段，帝国迅速整合了前代文明的精华，建立了七大魔导学院，这些学院不仅成为知识的中心，更是推动社会进步的重要力量。\\n\\n随着时间推移，万象帝国进入了其发展阶段，社会、技术和魔法均取得了显著进步。魔法与科技的融合催生了前所未有的发明，如魔法驱动的机械和科技强化的法术，极大地改善了民众的生活。著名历史人物如人类领袖阿尔德里克、精灵女王赛琳娜和矮人工程师格罗姆，他们的智慧和勇气为帝国的繁荣奠定了基础。\\n\\n繁荣时期的万象帝国，疆域覆盖了已知世界的大部分地区，成为了一个稳定和谐的社会。七大魔导学院的学者们不断探索未知，推动了魔法和科学的界限。帝国的黄金时代，是和平与创新的象征，各族文化交融，共同创造了灿烂的文明。\\n\\n然而，权力的集中最终导致了帝国的衰落。'皇极之乱'爆发，七位大魔导为争夺至高王位，不惜释放禁忌魔法，这场内斗不仅耗尽了帝国的资源，更撕裂了多族联盟的纽带。社会动荡，技术停滞，魔法失控，万象帝国的辉煌逐渐黯淡。\\n\\n毁灭过程是迅速而惨烈的。禁忌魔法的滥用引发了连锁反应，整个帝国的魔法网络崩溃，科技装置失效，最终导致了一场无法挽回的灾难。万象帝国，这个曾经的光辉文明，在权力欲望的火焰中化为灰烬，第5纪元也随之结束。"
    },
    "race": {
        "main_race": "精灵",
        "sub_race": "月光使者",
        "description": "月光使者是精灵族中与自然和月亮魔法有着深厚联系的子种族。他们在夜晚拥有增强的魔法能力，是帝国中重要的魔法顾问和守护者。"
    },
    "stats": {
        "level": 1,
        "experience": 0,
        "health": 100,
        "energy": 100,
        "magic": 50
    },
    "inventory": [],
    "journal": [
        {
            "entry_id": 1,
            "title": "开始旅程",
            "content": "我的名字是Andvc，魔导技师是魔法与科技融合的专家，他们设计和维护魔法驱动的机械装置，是帝国技术进步的核心力量。",
            "timestamp": "2025-05-08T00:34:05"
        }
    ],
    "quests": [],
    "relationships": [],
    "known_locations": [],
    "story_state": {
        "current_chapter": 1,
        "chapter_title": "命运的召唤",
        "plot_points": [],
        "decisions": []
    },
    "selected_choice": "",
    "careers": [
        {
            "name": "原初法则编织者",
            "description": "原初法则编织者是万象帝国第5纪元中极为稀有的存在，他们拥有接触并重塑世界本源的能力。这些存在通常被视为真神级别的化身，或是宇宙间最古老力量的继承者。他们的力量不仅仅局限于创造或毁灭，更在于能够改写世界的根本法则，使得宇宙的规则在他们的意志下重新编织。",
            "growth_path": "从学徒开始，学习基础的魔法和机械知识，逐步掌握复杂的魔导技术，最终成为能够独立设计和发明新装置的大师。",
            "special_abilities": "能够设计和制造魔法驱动的机械装置，解决魔法与科技结合中的技术难题。",
            "origin": "在万象帝国的第5纪元，随着魔法体系与技术水平达到前所未有的高度，少数个体通过深奥的仪式或是偶然的机遇，触及了世界的本源。这些个体被称为原初法则编织者，他们的存在本身就是对世界规则的一种挑战和重塑。",
            "attributes": [
                "能够感知并操控世界的基本法则",
                "可以在有限的范围内创造或消除物理和魔法法则",
                "拥有近乎无限的生命力和能量储备",
                "能够进行跨维度的旅行和通讯",
                "对绝大多数形式的攻击和魔法免疫"
            ],
            "usage": "原初法则编织者的力量在万象帝国中既是祝福也是诅咒。他们可以用于维护世界的平衡，防止灾难性的法则崩溃，也可以被用于个人的野心，试图重塑世界以满足一己之欲。他们的存在使得第5纪元的政治和宗教格局充满了不确定性和神秘色彩。",
            "id": "career_1747220983_f2a0f3a7",
            "level": 7,
            "created_at": "2025-05-14T19:10:02"
        }
    ]
}