{
    "id": "temp_character_creation_1746799852",
    "era": {
        "id": "grand_empire_era",
        "name": "万象帝国",
        "era_number": 5,
        "key_features_joined": "人类领导的多族联盟, 魔法与科技平衡发展, 将前代文明知识整合, 创造稳定和谐社会",
        "dominant_races_joined": "人类, 精灵, 矮人, 灵族",
        "magic_system": "综合魔法学院体系",
        "technology_level": "魔法与科技融合",
        "destruction_cause": "权力集中导致'皇极之乱'，七位大魔导争夺至高王位，释放禁忌魔法"
    },
    "era_history": "万象帝国，作为第5纪元的辉煌代表，其起源可追溯至意识瘟疫后的废墟之中。在这场几乎摧毁所有文明的灾难后，人类以其惊人的适应力和领导才能，联合精灵、矮人及灵族，共同建立了一个多族联盟。早期，帝国致力于整合前代文明的碎片知识，将魔法与科技的结合作为重建的基石，逐渐形成了一个稳定而和谐的社会。\\n\\n在发展阶段，七大魔导学院的建立标志着万象帝国知识与力量的巅峰。这些学院不仅成为了魔法研究的中心，也促进了科技与魔法融合技术的飞速发展。著名历史人物如人类领袖阿尔德里克、精灵女王瑟兰迪尔、矮人王格罗姆以及灵族智者维拉尼亚，他们的智慧和远见为帝国的繁荣奠定了基础。\\n\\n繁荣时期的万象帝国，其疆域覆盖了已知世界的大部分地区，成为了一个魔法与理性科学并重的乌托邦。社会高度发达，各族和谐共处，艺术、文化和科技都达到了前所未有的高度。\\n\\n然而，权力的集中最终导致了帝国的衰落。七位大魔导为争夺至高王位，爆发了被称为'皇极之乱'的内战。这场冲突不仅撕裂了帝国的社会结构，更因禁忌魔法的释放而引发了无法控制的灾难。\\n\\n毁灭过程中，禁忌魔法的力量超出了所有人的预期，不仅摧毁了帝国的核心区域，还导致了魔法与科技平衡的彻底崩溃。最终，万象帝国在这场自我毁灭的灾难中走向了终结，留给后世的只有废墟和教训。",
    "race_options": [
        {
            "main_race": "人类",
            "sub_race": "北方人",
            "description": "北方人以坚韧和适应力著称，他们在意识瘟疫后的废墟中迅速崛起，成为万象帝国的领导者。他们的文化强调实用主义和集体利益，擅长将魔法与科技结合以解决实际问题。"
        },
        {
            "main_race": "精灵",
            "sub_race": "森林精灵",
            "description": "森林精灵与自然有着深厚的联系，他们在万象帝国中负责维护生态平衡和魔法能量的流动。他们的社会结构松散但高度自治，擅长生命魔法和远程战斗。"
        },
        {
            "main_race": "矮人",
            "sub_race": "山丘矮人",
            "description": "山丘矮人以他们的工艺和建筑技术闻名，是万象帝国中不可或缺的建筑师和工程师。他们的文化重视家族和传统，擅长土系魔法和机械制造。"
        }
    ],
    "career_options": [
        {
            "name": "魔导工程师",
            "description": "魔导工程师是万象帝国中魔法与科技融合的先锋，他们设计并维护帝国的魔法机械和能源系统。社会地位高，常见活动包括研究、设计和实地测试。",
            "growth_path": "从学徒开始，学习基础魔法和工程知识，逐步参与项目设计，最终成为能够独立领导大型工程的魔导大师。",
            "special_abilities": "能够设计和操控复杂的魔法机械，擅长将魔法能量转化为实用技术。"
        },
        {
            "name": "元素使者",
            "description": "元素使者是精通元素魔法的法师，他们在帝国中担任环境保护者和能量调节者的角色。社会地位崇高，常见活动包括元素平衡仪式和魔法研究。",
            "growth_path": "从元素学徒开始，逐步掌握更多元素的控制，最终能够召唤并控制强大的元素生物。",
            "special_abilities": "能够召唤和控制元素生物，擅长使用元素魔法进行攻击和防御。"
        },
        {
            "name": "灵族智者",
            "description": "灵族智者是灵族中的知识守护者，他们在万象帝国中担任顾问和学者的角色。社会地位尊贵，常见活动包括历史研究、魔法理论和预言。",
            "growth_path": "从学者开始，深入研究古代知识和魔法理论，最终能够预见未来并指导帝国的发展方向。",
            "special_abilities": "能够进行预言和心灵感应，擅长使用精神魔法影响他人。"
        }
    ],
    "selected_choice": ""
}