{
  "system_name": "七级能力体系",
  "description": "这是一个适用于艾塔莱亚世界各个纪元的通用能力等级划分体系，可用于衡量生物的能力、物品的品质、法术的威力等。",
  "purpose": "提供一个统一的标准，用于量化和比较世界中各种力量、技艺和品质的等级。",
  "levels": [
    {
      "level": 1,
      "name": "基础",
      "universal_description": "最基础的能力水平，代表刚刚入门或具备最低限度的效能。这个等级的力量或品质在日常生活中可能有一定用处，但在真正的挑战面前几乎无法产生显著影响。对应普通人日常所能掌握的技能水平或常见物品的基本品质。",
      "power_range": "能影响单一个体的日常活动，效果轻微且范围极其有限。",
      "examples": {
        "ability": "农夫能够使用简单工具耕种，学徒掌握基础手艺，新手冒险者能够应对最弱小的野兽",
        "item": "普通铁制武器，简单的生活用品，无特殊效果的日常物品",
        "magic": "能点燃蜡烛的微弱火苗，短暂照明的光亮术，治疗轻微擦伤的法术"
      }
    },
    {
      "level": 2,
      "name": "进阶",
      "universal_description": "显著超越基础水平，代表经过系统训练或精心制作的成果。这个等级的能力在特定领域中已经相当有效，能够可靠地解决相应范畴内的常见问题。对应专业人士的基本工作水准或优质日常用品的品质。",
      "power_range": "能影响小群体或小范围环境，产生明确可见的效果。",
      "examples": {
        "ability": "熟练工匠能制作精美物品，城市卫兵掌握基本战斗技巧，有经验的冒险者能独自完成简单任务",
        "item": "精工打造的武器，具有特殊材质的护甲，带有简单附魔的工具",
        "magic": "能产生小型火球的法术，治疗普通伤口的治愈术，短时间强化身体素质的增益法术"
      }
    },
    {
      "level": 3,
      "name": "精通",
      "universal_description": "代表在某一领域达到了专家水平，经过长期磨练所获得的高度熟练状态。这个等级的能力或物品在其领域内堪称优秀，能够应对绝大多数相关挑战。对应行业精英或高品质专业装备的水准。",
      "power_range": "能影响中型群体或区域，效果强大且持久，可能对环境产生短期改变。",
      "examples": {
        "ability": "王国精锐士兵的战斗技巧，著名大师的工艺水平，资深冒险者解决复杂危机的能力",
        "item": "名匠打造的精良武器，能抵御元素伤害的护甲，具有特殊功能的魔法道具",
        "magic": "能摧毁小型建筑的火焰爆发，治疗严重伤势的高阶治愈，能改变局部天气的法术"
      }
    },
    {
      "level": 4,
      "name": "卓越",
      "universal_description": "远超常人理解的卓越水平，代表接近人类极限的能力或极其珍贵的物品品质。这个等级的力量在历史上都会留下记录，成为传说的起点。对应一个时代的标志性大师或国宝级装备的水准。",
      "power_range": "能影响大型区域或城市规模的群体，效果强大且影响深远，可能改变局部地区的生态或社会结构。",
      "examples": {
        "ability": "传奇将军指挥千军万马，改变战局的谋略大师，能单挑巨龙的英雄",
        "item": "王室珍藏的传世名剑，能抵御多种危险的奇特护甲，具有强大力量的古代神器",
        "magic": "摧毁一座小城的元素风暴，起死回生的复活术，永久改变一片土地特性的大型法术"
      }
    },
    {
      "level": 5,
      "name": "传奇",
      "universal_description": "超越凡俗界限的传奇水平，已经触及到某个领域的巅峰极限。这个等级的能力或物品在历史长河中都极为罕见，往往与改变历史的重大事件相关联。对应历史上最伟大的少数天才或传说中的神器。",
      "power_range": "能影响一个国家或区域性的大范围，效果威力巨大，可能永久改变一个地区的自然或文化格局。",
      "examples": {
        "ability": "能凭一己之力抵挡一支军队的传奇英雄，创立全新学派的大师，被历史铭记的伟大领袖",
        "item": "龙族珍藏的远古神兵，来自失落文明的强大装备，具有改变使用者命运的神秘圣物",
        "magic": "毁灭一座大城的灾难性法术，创造生命的禁忌之术，能改变一个国家气候的大型仪式魔法"
      }
    },
    {
      "level": 6,
      "name": "神话",
      "universal_description": "接近神话传说的不可思议水平，超越了凡人理解的界限。这个等级的能力或物品在整个世界历史上都寥寥可数，常被视为神迹或奇迹的体现。对应半神级别的存在或足以改变世界格局的神器。",
      "power_range": "能影响整个大陆或世界的一个主要部分，威力足以改变世界的自然规律或文明走向。",
      "examples": {
        "ability": "能单独对抗一个王国全部力量的存在，创造全新魔法体系的大贤者，被当作神明崇拜的人物",
        "item": "上古神明遗留的神器，能改变大陆地形的强大装置，传说中能实现愿望的奇迹之物",
        "magic": "改变大陆地貌的灾难性法术，创造全新种族的造物之术，能影响整个世界魔法潮汐的禁忌仪式"
      }
    },
    {
      "level": 7,
      "name": "原初",
      "universal_description": "接触世界本源的终极境界，代表着能够重塑世界规则的力量。这个等级的能力或物品在宇宙尺度上都极为稀有，往往与世界的创生或毁灭相联系。对应真神级别的存在或能够改变世界根本法则的原初神器。",
      "power_range": "能影响整个世界或多元宇宙，可以重塑现实的基本规则或创造全新的存在维度。",
      "examples": {
        "ability": "创造或毁灭一个世界的力量，能够书写或修改世界基本法则的存在，超越时空限制的全知全能",
        "item": "创世神器，能够连接多元宇宙的节点装置，包含一个微型宇宙的奇迹容器",
        "magic": "创造或毁灭一个世界的原初法术，改变宇宙基本规则的神秘仪式，跨越时间长河影响过去未来的禁忌之术"
      }
    }
  ],
  "application_domains": [
    "人物能力评级",
    "装备品质划分",
    "法术威力分级",
    "生物危险度分类",
    "奇迹与灾难等级",
    "工艺与技艺水平",
    "资源与材料价值"
  ],
  "notes": [
    "这一体系在不同纪元中可能有不同的名称和表现形式，但基本分级标准保持一致",
    "各纪元的等级命名可能基于当时的主流文化、信仰或科技背景",
    "普通人通常处于1-2级，历史上的伟大人物可能达到3-4级，传说中的英雄可能达到5级，而6-7级通常被视为神话或传说",
    "在物品分级上，1-3级代表常见到稀有物品，4-5级代表传世珍品，6-7级代表足以改变历史的神器",
    "不同领域可能根据此体系衍生出更细化的专业分级系统"
  ]
} 